DEEPLAD2003/STM32-Driver-Developement/Projects/Alarm_Clock/lcd.c
#include <stdint.h>
#include "stm32f10x_GPIO.h"
#include "lcd.h"

static void write_4_bits(uint8_t value);
static void lcd_enable(void);
static void udelay(uint32_t cnt);

void lcd_send_command(uint8_t cmd)
{
	/* RS=0 for LCD command */
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_CONF, LCD_GPIO_RS, RESET_PIN);

	/*R/nW = 0, for write */
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_CONF, LCD_GPIO_RW, RESET_PIN);

	write_4_bits(cmd >> 4);
	write_4_bits(cmd & 0x0F);

}

/*
 *This function sends a character to the LCD
 *Here we used 4 bit parallel data transmission.
 *First higher nibble of the data will be sent on to the data lines D4,D5,D6,D7
 *Then lower nibble of the data will be set on to the data lines D4,D5,D6,D7
 */
void lcd_print_char(uint8_t data)
{
	/* RS=1 for LCD user data */
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_CONF, LCD_GPIO_RS, SET_PIN);

	/*R/nW = 0, for write */
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_CONF, LCD_GPIO_RW, RESET_PIN);

	write_4_bits(data >> 4);  /*Higher nibble*/
	write_4_bits(data & 0x0F); /*Lower nibble*/

}


void lcd_print_string(char *message)
{

      do
      {
        lcd_print_char((uint8_t)*message++);
				mdelay(100);
      }
      while (*message != '\0');

}


void lcd_init(void)
{

	//1. Configure the gpio pins which are used for lcd connections

	GPIO_Handle_t lcd_signal;

	lcd_signal.pGPIOx = LCD_GPIO_PORT_CONF;
	lcd_signal.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT50;
	lcd_signal.GPIO_PinConfig.GPIO_PinNumber = LCD_GPIO_RS;
	lcd_signal.GPIO_PinConfig.GPIO_Config = GPIO_CNF_PP;
	GPIO_PCLK_CRT(GPIOA,ENABLE);
	GPIO_PCLK_CRT(GPIOC,ENABLE);

	GPIO_Init(&lcd_signal);

	lcd_signal.GPIO_PinConfig.GPIO_PinNumber = LCD_GPIO_RW;
	GPIO_Init(&lcd_signal);

	lcd_signal.GPIO_PinConfig.GPIO_PinNumber = LCD_GPIO_EN;
	GPIO_Init(&lcd_signal);
	
	lcd_signal.pGPIOx = LCD_GPIO_PORT_DATA;
	lcd_signal.GPIO_PinConfig.GPIO_PinNumber = LCD_GPIO_D4;
	GPIO_Init(&lcd_signal);

	lcd_signal.GPIO_PinConfig.GPIO_PinNumber = LCD_GPIO_D5;
	GPIO_Init(&lcd_signal);

	lcd_signal.GPIO_PinConfig.GPIO_PinNumber = LCD_GPIO_D6;
	GPIO_Init(&lcd_signal);

	lcd_signal.GPIO_PinConfig.GPIO_PinNumber = LCD_GPIO_D7;
	GPIO_Init(&lcd_signal);

	GPIO_WriteToOutputPin(LCD_GPIO_PORT_CONF, LCD_GPIO_RS, RESET_PIN);
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_CONF, LCD_GPIO_RW, RESET_PIN);
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_CONF, LCD_GPIO_EN, RESET_PIN);
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_DATA, LCD_GPIO_D4, RESET_PIN);
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_DATA, LCD_GPIO_D5, RESET_PIN);
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_DATA, LCD_GPIO_D6, RESET_PIN);
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_DATA, LCD_GPIO_D7, RESET_PIN);

	//2. Do the LCD initialization

	mdelay(40);

	/*RS = 0 , For LCD command */
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_CONF, LCD_GPIO_RS, RESET_PIN);

	/* RnW = 0, Writing to LCD */
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_CONF, LCD_GPIO_RW, RESET_PIN);

	write_4_bits(0x3);

	mdelay(5);

	write_4_bits(0x3);

	udelay(150);

	write_4_bits(0x3);
	write_4_bits(0x2);

	//function set command
	lcd_send_command(LCD_CMD_4DL_2N_5X8F);

	//disply ON and cursor ON
	lcd_send_command(LCD_CMD_DON_CURON);

	lcd_display_clear();

	//entry mode set
	lcd_send_command(LCD_CMD_INCADD);



}

/* writes 4 bits of data/command on to D4,D5,D6,D7 lines */
static void write_4_bits(uint8_t value)
{
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_DATA,LCD_GPIO_D4, ((value >> 0) & 0x1) );
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_DATA,LCD_GPIO_D5, ((value >> 1) & 0x1) );
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_DATA,LCD_GPIO_D6, ((value >> 2) & 0x1) );
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_DATA,LCD_GPIO_D7, ((value >> 3) & 0x1) );

	lcd_enable();

}

void lcd_display_clear(void)
{
	//Display clear
	lcd_send_command(LCD_CMD_DIS_CLEAR);

	/*
	 * check page number 24 of datasheet.
	 * display clear command execution wait time is around 2ms
	 */

	mdelay(2);
}


/*Cursor returns to home position */
void lcd_display_return_home(void)
{

	lcd_send_command(LCD_CMD_DIS_RETURN_HOME);
	/*
	 * check page number 24 of datasheet.
	 * return home command execution wait time is around 2ms
	 */
	mdelay(2);
}


/**
  *   Set Lcd to a specified location given by row and column information
  *   Row Number (1 to 2)
  *   Column Number (1 to 16) Assuming a 2 X 16 characters display
  */
void lcd_set_cursor(uint8_t row, uint8_t column)
{
  column--;
  switch (row)
  {
    case 1:
      /* Set cursor to 1st row address and add index*/
      lcd_send_command((column |= 0x80));
      break;
    case 2:
      /* Set cursor to 2nd row address and add index*/
        lcd_send_command((column |= 0xC0));
      break;
    default:
      break;
  }
}



static void lcd_enable(void)
{
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_CONF, LCD_GPIO_EN, SET_PIN);
	udelay(10);
	GPIO_WriteToOutputPin(LCD_GPIO_PORT_CONF, LCD_GPIO_EN, RESET_PIN);
	udelay(100);/* execution time > 37 micro seconds */
}

/*void lcd_print_time(RTC_Time *time){
	lcd_set_cursor(1,1);
	lcd_print_string("Time - ");
	lcd_print_string((char*) time->hours );
	lcd_print_char(0x3A);
	lcd_print_string((char*) time->minutes);
	lcd_print_char(0x3A);
	lcd_print_string((char*) time->seconds);	
}*/

void mdelay(uint32_t cnt)
{
	for(uint32_t i=0 ; i < (cnt * 1000); i++);
}

static void udelay(uint32_t cnt)
{
	for(uint32_t i=0 ; i < (cnt * 1); i++);
}
